import java.io.FileWriter;
import java.io.IOException;
import java.time.LocalDateTime;
import java.time.format.DateTimeFormatter;

/**
 * Реализовать алгоритм сортировки слиянием (НЕОБЯЗАТЕЛЬНОЕ)
 */

public class Home_Work_1 {
    public static void main(String[] args)  {
        System.out.println("gfhjsdf");

    }
}
